{
  "architectures": [
    "VoxtralRealtimeForConditionalGeneration"
  ],
  "audio_config": {
    "activation_function": "gelu",
    "attention_dropout": 0.0,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1280,
    "initializer_range": 0.02,
    "intermediate_size": 5120,
    "max_position_embeddings": 1500,
    "model_type": "voxtral_realtime_encoder",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "num_mel_bins": 128,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "rope_theta": 1000000.0,
      "rope_type": "default"
    },
    "sliding_window": 750,
    "vocab_size": 131072
  },
  "audio_length_per_tok": 8,
  "default_num_delay_tokens": 6,
  "downsample_factor": 4,
  "dtype": "bfloat16",
  "hidden_size": 3072,
  "model_type": "voxtral_realtime",
  "projector_hidden_act": "gelu",
  "text_config": {
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 9216,
    "max_position_embeddings": 131072,
    "model_type": "voxtral_realtime_text",
    "num_attention_heads": 32,
    "num_hidden_layers": 26,
    "num_key_value_heads": 8,
    "pad_token_id": null,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "rope_theta": 1000000.0,
      "rope_type": "default"
    },
    "sliding_window": 8192,
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 131072
  },
  "transformers_version": "5.2.0.dev0"
}
